//////////////////////////////////////////////////////////////////////////////////////////
// Интерфейс управления средствами мультимедиа на мобильном устройстве
// 
//////////////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

// Снимает фотографию, при помощи камеры устройства
//
// Параметры:
//  ТипКамеры	 -  ТипКамерыУстройства - Какой камерой будет сделан снимок, если не задан, то по-умолчанию режим Авто.
//  Качество	 - Число - Качество снимка в процентах
//  ЧерноБелый	 - Булево - Истина, если требуется сделать ч/б фото
// 
// Возвращаемое значение:
//  * ДанныеМультимедиа - Данные фотографии
//  * Неопределено - Снимок не удалось сделать или фотография не поддерживается самим устройством
//
Функция СделатьФотографию(ТипКамеры = Неопределено, Качество = 100, ЧерноБелый = Ложь) Экспорт	
	
	#Если МобильноеПриложениеКлиент Тогда
		ТекТипКамеры = ТипКамерыУстройства.Авто;
		Если ТипКамеры <> Неопределено Тогда
			ТекТипКамеры = ТипКамеры;
		КонецЕсли;
		
		Если СредстваМультимедиа.ПоддерживаетсяФотоснимок(ТекТипКамеры) Тогда
			Если Не УправлениеМультимедиаВызовСервера.ДелатьФотоАндроидАПИ() Тогда
				Возврат СделатьФотоСредствами1С(ТекТипКамеры);
			Иначе
				Возврат СделатьФотоСредствамиAndroid();
			КонецЕсли;
		Иначе
			 ВызватьИсключение НСтр("ru='Выбранная камера не поддерживается Вашим устройством!'");
		КонецЕсли;
	#Иначе
		Возврат Неопределено;
	#КонецЕсли
	
КонецФункции

// Делает аудиозапись средствами мобильного устройства
// 
// Возвращаемое значение:
//  * ДанныеМультимедиа - Данные аудиозаписи
//  * Неопределено - Не удалось сделать запись или микрофон не поддерживается самим устройством
//
Функция СделатьАудиозапись() Экспорт	
	
	#Если МобильноеПриложениеКлиент Тогда		
		Если СредстваМультимедиа.ПоддерживаетсяАудиозапись() Тогда
			Возврат СредстваМультимедиа.СделатьАудиозапись();
		Иначе			
			ВызватьИсключение НСтр("ru='Ваше устройство не поддерживает аудиозапись!'");
		КонецЕсли;
	#Иначе
		Возврат Неопределено;	
	#КонецЕсли
	
КонецФункции

// Выполняет видеозапись с выбранной камеры устройства
//
// Параметры:
//  Качество	 - КачествоВидеозаписи - Качество записи. Если не указан, то Авто
//  ТипКамеры	 -  ТипКамерыУстройства - Какой камерой будет сделана запись, если не задан, то по-умолчанию режим Авто.
// 
// Возвращаемое значение:
//  * ДанныеМультимедиа - Данные видеозаписи
//  * Неопределено - Не удалось сделать запись или камера не поддерживается самим устройством
//
Функция СделатьВидеозапись(Качество = Неопределено, ТипКамеры = Неопределено) Экспорт	
	
	#Если МобильноеПриложениеКлиент Тогда
		ТекКачество = КачествоВидеозаписи.Авто;
		Если Качество <> Неопределено Тогда
			ТекКачество = Качество;
		КонецЕсли;	
		
		ТекТипКамеры = ТипКамерыУстройства.Авто;
		Если ТипКамеры <> Неопределено Тогда
			ТекТипКамеры = ТипКамеры;
		КонецЕсли;	
		
		Если СредстваМультимедиа.ПоддерживаетсяВидеозапись(ТекТипКамеры) Тогда
			Возврат СредстваМультимедиа.СделатьВидеозапись(ТекТипКамеры, ТекКачество);
		Иначе			
			 ВызватьИсключение НСтр("ru='Выбранная камера не поддерживается Вашим устройством!'");
		КонецЕсли;
	#Иначе
		Возврат Неопределено;	
	#КонецЕсли
	
КонецФункции

Функция ОткрытьКартинкуИзПамяти() Экспорт
	
	Результат = Неопределено;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	//Диалог.Каталог = "\storage\sdcard0\DCIM\Camera";
	Диалог.Каталог = ДанныеИБ.КаталогФото();
	//#Если МобильноеПриложениеКлиент Тогда
	//	Диалог.Каталог = КаталогБиблиотекиМобильногоУстройства(ТипКаталогаБиблиотекиМобильногоУстройства.Видео);
	//#КонецЕсли
	Если Диалог.Выбрать() Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("Файл", Неопределено);
		Результат.Вставить("РасширениеФайла", "");
		
		ВыбраннаяКартинка = Новый Картинка(Диалог.ПолноеИмяФайла);
		Результат.Файл = ВыбраннаяКартинка;
		ФайлКартинки = Новый Файл(Диалог.ПолноеИмяФайла);
		Результат.РасширениеФайла = ФайлКартинки.Расширение;
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Calls an android app - Ha_Paint and pass image to edit. 
// Android app mmust be installed on the device. 
//
// Parameters:
//  Address  - String - ref on the temporare storage or database object.
//
Функция ИзменитьФотоВPaint(Адрес) Экспорт
	
	Результат = Неопределено;
	
	#Если МобильноеПриложениеКлиент Тогда
	
	Картинка = УправлениеМультимедиаВызовСервера.ПрочитатьКартинкуИзБазы(Адрес);
	ПутьКартинки = ДанныеИБ.КаталогКартинок() + Новый УникальныйИдентификатор() + ".png";
	
	ПоказатьПредупреждение(, ПутьКартинки);
	Картинка.Записать(ПутьКартинки);
	
	НовВз = Новый ЗапускПриложенияМобильногоУстройства();
	НовВз.Действие = "com.ripreal.homeassistant.PaintActivity";
	НовВз.ДополнительныеДанные.Добавить("image", ПутьКартинки, "String");
	НовВз.Запустить(Истина);
	
	Картинка = Неопределено;
	
	ФайлОбработаннойКартинки = Новый Файл(ПутьКартинки);
	//ПоказатьПредупреждение(, "Файл существует " + ФайлКартинки);
	Если ФайлОбработаннойКартинки.Существует() Тогда
		
		Результат = Новый Структура;
		ОбработаннаяКартинка = Новый Картинка(ПутьКартинки);
		
		//УдалитьФайлы(Адрес);
		Результат.Вставить("Файл", ОбработаннаяКартинка);
		Результат.Вставить("РасширениеФайла", ФайлОбработаннойКартинки.Расширение);
		
	КонецЕсли;
	
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

//// Calls an android app - Ha_Paint and pass image to edit. 
//// Android app mmust be installed on the device. 
////
//// Parameters:
////  Address  - String - ref on the temporare storage or database object.
////
//Функция ИзменитьФотоВPaint(Адрес) Экспорт
//	
//	Результат = Неопределено;
//	
//	Картинка = УправлениеМультимедиаВызовСервера.ПрочитатьКартинкуИзБазы(Адрес);
//	
//	ФайлКартинки = "sdcard/DCIM/Camera/" + Новый УникальныйИдентификатор() + ".png";
//	Картинка.Записать(ФайлКартинки);
//	Файл = Новый Файл("file:///" + ФайлКартинки);
//	//ПоказатьПредупреждение(, "Файл существукет! " + Файл.Существует());
//	#Если МобильноеПриложениеКлиент Тогда
//		
//		НовВз = Новый ЗапускПриложенияМобильногоУстройства();
//		НовВз.Действие = "com.ripreal.homeassistant.PaintActivity";
//		//НовВз.ДополнительныеДанные.Добавить("image", "file:///" + ФайлКартинки, "String");
//		НовВз.ДополнительныеДанные.Добавить("android.intent.extra.STREAM", "file:///" + ФайлКартинки, "Uri");
//		НовВз.Запустить(Истина);
//		
//		Для каждого КлючИЗначение Из НовВз.ДополнительныеДанные Цикл
//			ПоказатьПредупреждение(, "Ключ" + Строка(КлючИЗначение.Ключ) + " Значение" 
//			+ Строка(КлючИЗначение.Значение)); 
//		КонецЦикла;
//		
//		ЭлементДанных = НовВз.ДополнительныеДанные.Получить("image");
//		Если ЭлементДанных <> Неопределено Тогда
//			ПутьККартинке = ЭлементДанных.Значение;
//			ФайлКартинки = Новый Файл(ПутьККартинке);
//			ПоказатьПредупреждение(, "путь к картинке " + ПутьККартинке);
//			ПоказатьПредупреждение(, "Файл существует" + ФайлКартинки.Существует());
//			Если ФайлКартинки.Существует() Тогда
//				
//				Результат = Новый Структура;
//				Результат.Вставить("Файл", Новый Картинка(ПутьККартинке));
//				Результат.Вставить("РасширениеФайла", ФайлКартинки.Расширение);
//				
//			КонецЕсли;
//		КонецЕсли;
//		
//	#КонецЕсли
//	
//	ПоказатьПредупреждение(, Результат.Файл);
//	
//	Возврат Результат;
//	
//КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СделатьФотоСредствами1С(ТекТипКамеры)
	#Если МобильноеПриложениеКлиент Тогда
		Возврат СредстваМультимедиа.СделатьФотоснимок(ТекТипКамеры);
	#КонецЕсли
КонецФункции

Функция СделатьФотоСредствамиAndroid()
		
	#Если МобильноеПриложениеКлиент Тогда
		
		ФайлКартинки = "file:///sdcard/DCIM/Camera/" + Новый УникальныйИдентификатор() + ".png";
		НовВз = Новый ЗапускПриложенияМобильногоУстройства("android.media.action.IMAGE_CAPTURE");
		
		//Обязательно указываем этот параметр, если его не указать, тогда вам вернется привью файла в низком качестве и находится он будет в параметрах с ключем data.
		НовВз.ДополнительныеДанные.Добавить("output", ФайлКартинки, "Uri");
		
		//Если фото не сделано, то ответ будет "0"
		Ответ = НовВз.Запустить(Истина);
		
		Если Ответ <> 0 Тогда
			Картинка = Новый Картинка(ФайлКартинки);
			// need to delete file created by android and put it in the temp storage
			//Адрес = ПоместитьВоВременноеХранилище(Картинка);
			УдалитьФайлы(ФайлКартинки);
			Возврат Картинка;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	#КонецЕсли
	
КонецФункции

#КонецОбласти