
Функция ДелатьФотоАндроидАПИ() Экспорт
	
	Возврат Константы.ДелатьФотоАндроидАПИ.Получить();
	
КонецФункции 

Функция УстановитьДелатьФотоАндроидАПИ(Значение) Экспорт
	Константы.ДелатьФотоАндроидАПИ.Установить(Значение);
КонецФункции

Функция ПрочитатьКартинкуИзБазы(Адрес) Экспорт
	
	Битмап = Неопределено;
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		Битмап = ПолучитьИзВременногоХранилища(Адрес);
	Иначе
		УИДКартинки = ОбщегоНазначения.ПолучитьУИДпоНавигационнойСсылке(Адрес);
		СсылкаНаФайл = Справочники.ПрикрепленныеФайлы.ПолучитьСсылку(УИДКартинки);
		ДвоичныеКартинки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаФайл, "ДанныеФайла");
		Битмап = ДвоичныеКартинки.Получить();
	КонецЕсли;
	
	Возврат Битмап;
	
КонецФункции
