
&НаКлиенте
// На мобильном приложении текущая строка теряется, поэтому сохраняем в переменной
Перем ТекСтрокаТЗ;

#Область ОбработчикиТЧРегламентныеРаботы

&НаКлиенте
Процедура ДобавитьРаботу(Команда)
	ТекСтрокаХарактеристики = Неопределено;
	ОткрытьФормуВыбора();
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеРаботыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрокаТЗ = Неопределено Тогда
		ТекСтрока = Объект.РегламентныеРаботы.Добавить();
		Элементы.РегламентныеРаботы.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	Иначе
		ТекСтрока = ТекСтрокаТЗ;
	КонецЕсли;
	Элементы.РегламентныеРаботы.ТекущийЭлемент = Неопределено;
	ТекСтрока.РегламентнаяРабота = ВыбранноеЗначение;
	ТекСтрока.Интервал = 12;

КонецПроцедуры

&НаКлиенте
Процедура РегламентныеРаботыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрокаТЗ = Элементы.РегламентныеРаботы.ТекущиеДанные;
	ОткрытьФормуВыбора();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФормы

&НаКлиенте
Процедура ОткрытьФормуВыбора()
	
	ОткрытьФорму("Справочник.РегламентныеРаботы.ФормаВыбора",, Элементы.РегламентныеРаботы);
	
КонецПроцедуры

#КонецОбласти