//////////////////////////////////////////////////////////////////////////////////////////
// Интерфейс управления средствами мультимедиа на мобильном устройстве для вызова сервера
// 
//////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ДелатьФотоАндроидАПИ() Экспорт
	
	Возврат Константы.ДелатьФотоАндроидАПИ.Получить();
	
КонецФункции 

Функция УстановитьДелатьФотоАндроидАПИ(Значение) Экспорт
	Константы.ДелатьФотоАндроидАПИ.Установить(Значение);
КонецФункции

// По адресу на временное хранилище или навигационной ссылке возвращает 
// прикрепленный файл из базы.
//
// Параметры:
//  Адрес	 - Строка - Адрес на временное хранилище или навишационная ссылка
// 
// Возвращаемое значение:
//  Картинка - картинка из базы или НЕОПРЕДЕЛЕНО, если не существует
//
Функция ПрочитатьКартинкуИзБазы(Адрес) Экспорт
	
	Битмап = Неопределено;
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		Битмап = ПолучитьИзВременногоХранилища(Адрес);
	Иначе
		УИДКартинки = ОбщегоНазначения.ПолучитьУИДпоНавигационнойСсылке(Адрес);
		СсылкаНаФайл = Справочники.ПрикрепленныеФайлы.ПолучитьСсылку(УИДКартинки);
		ДвоичныеКартинки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаФайл, "ДанныеФайла");
		Битмап = ДвоичныеКартинки.Получить();
	КонецЕсли;
	
	Возврат Битмап;
	
КонецФункции

#КонецОбласти