
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не (ЗначениеЗаполнено(ИсходнаяЕдИзм) 
		Или ЗначениеЗаполнено(КонечнаяЕдИзм)
		Или ЗначениеЗаполнено(ИсходноеКоличество)) Тогда
		
		ИсходнаяЕдИзм = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("004");
		КонечнаяЕдИзм = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("006");
		ИсходноеКоличество = 1000;
		
	КонецЕсли;
	
	ПересчитатьЕлиницуИзмерения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура КонечнаяЕдИзмПриИзменении(Элемент)
	 ПересчитатьЕлиницуИзмерения();
КонецПроцедуры

&НаКлиенте
Процедура ИсходнаяЕдИзмПриИзменении(Элемент)
	 ПересчитатьЕлиницуИзмерения();
КонецПроцедуры

&НаКлиенте
Процедура ИсходноеКоличествоПриИзменении(Элемент)
	 ПересчитатьЕлиницуИзмерения();
КонецПроцедуры

&НаКлиенте
Процедура КонечноеКоличествоПриИзменении(Элемент)
	
	ПересчитатьЕлиницуИзмеренияВИсходную();
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПересчитатьЕлиницуИзмерения()
	КонечноеКоличество = Справочники.КлассификаторЕдиницИзмерения.ПересчитатьЕдиницуИзмерения(ИсходнаяЕдИзм,
		КонечнаяЕдИзм, ИсходноеКоличество);
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЕлиницуИзмеренияВИсходную()
	
	ИсходноеКоличество = Справочники.КлассификаторЕдиницИзмерения.ПересчитатьЕдиницуИзмерения(КонечнаяЕдИзм,
		ИсходнаяЕдИзм, КонечноеКоличество);
	
КонецПроцедуры

#КонецОбласти