

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьПодсказкуВвода(Объект.Текст);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьНачальнуюСтраницу");
КонецПроцедуры

&НаКлиенте
Процедура ТекстИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ОбновитьПодсказкуВвода(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодсказкуВвода(Текст)
	
	Инфо = НСтр("ru = 'Напечатано - %1. Осталось - %2'; en = 'Printed - %1. Remained - %2'");
	ТекстИнфо = СтрШаблон(Инфо, СтрДлина(Текст), 500 - СтрДлина(Текст));
	
КонецПроцедуры


