
#Область СлужебныйПрограммныйИнтерфейс

Функция ОтчетныеПоказатели() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ремонты.КоличествоРемонтов КАК КоличествоРемонтов,
	|	ТО.КоличествоТО КАК КоличествоТО,
	|	Автомобили.КолвоАвто КАК КолвоАвто,
	|	Автомобили.Автомобиль КАК Автомобиль
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВнеплановыеРаботы.Ссылка) КАК КоличествоРемонтов
	|	ИЗ
	|		Документ.ВнеплановыеРаботы КАК ВнеплановыеРаботы) КАК Ремонты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РегистрацииТО.Ссылка) КАК КоличествоТО
	|		ИЗ
	|			Документ.РегистрацииТО КАК РегистрацииТО) КАК ТО
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МИНИМУМ(Автомобили.Ссылка) КАК Автомобиль,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Автомобили.Ссылка) КАК КолвоАвто
	|		ИЗ
	|			Справочник.Автомобили КАК Автомобили
	|		ГДЕ
	|			Автомобили.Активен = ИСТИНА) КАК Автомобили
	|		ПО (ИСТИНА)");
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МАКСИМУМ(РегистрацииТО.Пробег) КАК Пробег
	|ИЗ
	|	Документ.РегистрацииТО КАК РегистрацииТО
	|ГДЕ
	|	(РегистрацииТО.Автомобиль = &Автомобиль
	|			ИЛИ &Автомобиль = НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0");
	Запрос.УстановитьПараметр("Автомобиль", Выборка.Автомобиль);
	ВЫборкаПробег = Запрос.Выполнить().Выбрать();
	ВЫборкаПробег.Следующий();
	
	Показатели = Новый Соответствие;
	Показатели.Вставить(НСтр("ru = 'Всего ТО:'; en = 'Car checks total:'"), Выборка.КоличествоТО);
	Показатели.Вставить(НСтр("ru = 'Всего ремонтов:'; en = 'Repairs total:'"), Выборка.КоличествоРемонтов);
	Показатели.Вставить(НСтр("ru = 'Текущий ТО:'; en = 'Current service:'"), 
		СтрШаблон("№%1", ФормыСервисныеРаботыСервер.ТекущийНомерТО(Выборка.Автомобиль, ТекущаяДата(), ВЫборкаПробег.Пробег)));
	
	Возврат Показатели;
	
КонецФункции

#КонецОбласти