
#Область СлужебныйПрограммныйИнтерфейс

Функция ОтчетныеПоказатели() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ремонты.КоличествоРемонтов КАК КоличествоРемонтов,
	|	ТО.КоличествоТО КАК КоличествоТО
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВнеплановыеРаботы.Ссылка) КАК КоличествоРемонтов
	|	ИЗ
	|		Документ.ВнеплановыеРаботы КАК ВнеплановыеРаботы) КАК Ремонты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РегистрацииТО.Ссылка) КАК КоличествоТО
	|		ИЗ
	|			Документ.РегистрацииТО КАК РегистрацииТО) КАК ТО
	|		ПО (ИСТИНА)");
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Показатели = Новый Соответствие;
	Показатели.Вставить(НСтр("ru = 'Всего ТО:'; en = 'Car checks total:'"), Выборка.КоличествоТО);
	Показатели.Вставить(НСтр("ru = 'Всего ремонтов:'; en = 'Repairs total:'"), Выборка.КоличествоРемонтов);
	
	Возврат Показатели;
	
КонецФункции

#КонецОбласти