
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьПервоначальноеЗаполненние", 0.5, Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗавершениеВопроса(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьОбновление", 0.1, Истина);
	Иначе
		ОбновлениеИнформационнойБазыВызовСервера.УстановитьПризнакПервЗаполнения();
		ОбновлениеИнформационнойБазыВызовСервера.УстановитьВерсию();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПервоначальноеЗаполненние() Экспорт
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Выполнить первоначальное заполнение(можно выполнить самостоятельно в настройках)?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗапуститьОбновление()
	
	ОбновлениеИнформационнойБазыВызовСервера.ЗапуститьОбновление();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти