
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Выполнить первоначальное заполнение(можно выполнить самостоятельно в настройках)?", РежимДиалогаВопрос.ДаНет);
	
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗавершениеВопроса(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьОбновление", 0.1, Истина);
	Иначе
		ОбновлениеИнформационнойБазыВызовСервера.УстановитьПризнакПервЗаполнения();
		ОбновлениеИнформационнойБазыВызовСервера.УстановитьВерсию();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ЗапуститьОбновление()
	
	ОбновлениеИнформационнойБазыВызовСервера.ЗапуститьОбновление();
	Закрыть();
	
КонецПроцедуры

