
#Область СлужебныйПрограммныйИнтерфейс

Функция ОтчетныеПоказатели() Экспорт
	
	ПланТО = ТаблицаВнеплановыхТО(ТекущаяДата());
	
	ВидыТекущихТО = Новый Массив;
	ВидыТекущихТО.Добавить(ИмяПрошлогоВР());
	ВидыТекущихТО.Добавить(ИмяТекущееВР());
	
	НевыполненныеТО = 0;
	Для каждого СтрокаТО Из ПланТО Цикл
		Для каждого ВидТО Из ВидыТекущихТО Цикл
			Если Не ЗначениеЗаполнено(СтрокаТО[ВидТО + "ПоФакту"]) 
				И СтрокаТО[ВидТО + "Статус"] = Перечисления.СтатусыВыполненияТО.НеПройдено
				И СтрокаТО[ВидТО + "Номер"] > 0 Тогда
				НевыполненныеТО = НевыполненныеТО + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Показатели = Новый Соответствие;
	Показатели.Вставить(НСтр("ru = 'Невыполненные ТО:'; en = 'Not passed services:'"), НевыполненныеТО);
	
	Возврат Показатели;
	
КонецФункции

Функция ПолучитьВидыВР() Экспорт
	
	ВидыТО = Новый Массив;
	ВидыТО.Добавить(ИмяПрошлогоВР());
	ВидыТО.Добавить(ИмяТекущееВР());
	ВидыТО.Добавить(ИмяСледующееВР());
	
	Возврат ВидыТО;
	
КонецФункции

Функция ИмяПрошлогоВР() Экспорт
	
	Возврат "ПрошлоеВР";
	
КонецФункции

Функция ИмяТекущееВР() Экспорт
	
	Возврат "ТекущееВР";
	
КонецФункции

Функция ИмяСледующееВР() Экспорт
	
	Возврат "СледующееВР";
	
КонецФункции

Функция ТаблицаВнеплановыхТО(ДатаАнализа, Автомобиль = Неопределено) Экспорт
	
	Проверки.СвойствоЗаполнено(ДатаАнализа);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗарегистрированныеВР.Автомобиль КАК Автомобиль,
	|	ЗарегистрированныеВР.РегламентнаяРабота КАК РегламентнаяРабота,
	|	МАКСИМУМ(ЗарегистрированныеВРПред.Период) КАК ПериодПред,
	|	ЗарегистрированныеВР.Период КАК Период,
	|	МИНИМУМ(ЗарегистрированныеВРСлед.Период) КАК ПериодСлед
	|ПОМЕСТИТЬ ПериодыРабот
	|ИЗ
	|	РегистрСведений.ЗарегистрированныеВР КАК ЗарегистрированныеВР
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеВР КАК ЗарегистрированныеВРСлед
	|		ПО ЗарегистрированныеВР.РегламентнаяРабота = ЗарегистрированныеВРСлед.РегламентнаяРабота
	|			И ЗарегистрированныеВР.Автомобиль = ЗарегистрированныеВРСлед.Автомобиль
	|			И ЗарегистрированныеВР.Период < ЗарегистрированныеВРСлед.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеВР КАК ЗарегистрированныеВРПред
	|		ПО ЗарегистрированныеВР.Автомобиль = ЗарегистрированныеВРПред.Автомобиль
	|			И ЗарегистрированныеВР.РегламентнаяРабота = ЗарегистрированныеВРПред.РегламентнаяРабота
	|			И ЗарегистрированныеВР.Период > ЗарегистрированныеВРПред.Период
	|ГДЕ
	|	(ЗарегистрированныеВР.Автомобиль = &Автомобиль
	|			ИЛИ &Автомобиль = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗарегистрированныеВР.Автомобиль,
	|	ЗарегистрированныеВР.РегламентнаяРабота,
	|	ЗарегистрированныеВР.Период,
	|	ЗарегистрированныеВРПред.РегламентнаяРабота,
	|	ЗарегистрированныеВРСлед.РегламентнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗарегистрированныеВРСрезПоследних.Автомобиль КАК Автомобиль,
	|	ЗарегистрированныеВРСрезПоследних.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ПериодыРабот.ПериодПред КАК ПрошлоеВРПериод,
	|	ЗарегистрированныеВРСрезПоследних.Период КАК ТекущееВРПериод,
	|	ПериодыРабот.ПериодСлед КАК СледующееВРПериод,
	|	ЗарегистрированныеВРСрезПоследних.Сумма КАК ТекущееВРСумма
	|ПОМЕСТИТЬ ПоследниеВнеплановыеВР
	|ИЗ
	|	ПериодыРабот КАК ПериодыРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеВР.СрезПоследних(
	|				&ДатаАнализа,
	|				Автомобиль = &Автомобиль
	|					ИЛИ &Автомобиль = НЕОПРЕДЕЛЕНО) КАК ЗарегистрированныеВРСрезПоследних
	|		ПО (ЗарегистрированныеВРСрезПоследних.Период = ПериодыРабот.Период)
	|			И (ЗарегистрированныеВРСрезПоследних.Автомобиль = ПериодыРабот.Автомобиль)
	|			И (ЗарегистрированныеВРСрезПоследних.РегламентнаяРабота = ПериодыРабот.РегламентнаяРабота)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследниеВнеплановыеВР.Автомобиль КАК Автомобиль,
	|	ПоследниеВнеплановыеВР.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ПоследниеВнеплановыеВР.ПрошлоеВРПериод КАК ПрошлоеВРПериод,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыВыполненияТО.Пройдено) КАК ПрошлоеВРСтатус,
	|	ПоследниеВнеплановыеВР.ТекущееВРПериод КАК ТекущееВРПериод,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыВыполненияТО.Пройдено) КАК ТекущееВРСтатус,
	|	ПоследниеВнеплановыеВР.СледующееВРПериод КАК СледующееВРПериод,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыВыполненияТО.Пройдено) КАК СледующееВРСтатус,
	|	ЗарегистрированныеВРПред.Сумма КАК ПрошлоеВРСумма,
	|	ЗарегистрированныеВРСлед.Сумма КАК СледующееВРСумма,
	|	ПоследниеВнеплановыеВР.ТекущееВРСумма КАК ТекущееВРСумма
	|ИЗ
	|	ПоследниеВнеплановыеВР КАК ПоследниеВнеплановыеВР
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеВР КАК ЗарегистрированныеВРСлед
	|		ПО ПоследниеВнеплановыеВР.Автомобиль = ЗарегистрированныеВРСлед.Автомобиль
	|			И ПоследниеВнеплановыеВР.РегламентнаяРабота = ЗарегистрированныеВРСлед.РегламентнаяРабота
	|			И ПоследниеВнеплановыеВР.СледующееВРПериод = ЗарегистрированныеВРСлед.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеВР КАК ЗарегистрированныеВРПред
	|		ПО ПоследниеВнеплановыеВР.Автомобиль = ЗарегистрированныеВРПред.Автомобиль
	|			И ПоследниеВнеплановыеВР.РегламентнаяРабота = ЗарегистрированныеВРПред.РегламентнаяРабота
	|			И ПоследниеВнеплановыеВР.ПрошлоеВРПериод = ЗарегистрированныеВРПред.Период");
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ДатаАнализа", ДатаАнализа);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
