
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ЗарегистрированныеВР.Записывать = Истина;
	
	ДатаПриобретения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Автомобиль, "ДатаПриобретения");
	Для Каждого ТекСтрока Из ВыполненныеРаботы Цикл

		Движение = Движения.ЗарегистрированныеВР.Добавить();
		Движение.Период = Документы.ВнеплановыеРаботы.ДатаТОПоИнтервалу(ДатаПриобретения, Документы.ВнеплановыеРаботы.ИмяТекущееВР(), Дата);
		Движение.Автомобиль = Автомобиль;
		Движение.РегламентнаяРабота = ТекСтрока.РегламентнаяРабота;
		Движение.Сумма = ТекСтрока.ТекущееВРСумма;
		Движение.НомерТО = ТекущийНомерТО;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти