
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ЗарегистрированныеВР.Записывать = Истина;
	
	Для Каждого ТекСтрока Из ВыполненныеРаботы Цикл

		Движение = Движения.ЗарегистрированныеВР.Добавить();
		Движение.Период = ТекСтрока.ТекущееВРПериод;
		Движение.Автомобиль = Автомобиль;
		Движение.РегламентнаяРабота = ТекСтрока.РегламентнаяРабота;
		Движение.Сумма = ТекСтрока.ТекущееВРСумма;
		Движение.НомерТО = ТекущийНомерТО;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти