
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработка параметров формы
	Параметры.Свойство("Представление", Представление);
	Параметры.Свойство("ВладелецФайлов", ВладелецФайлов);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.СтруктураФайла, СтрокаСвойств());
	
	Если Не ЗначениеЗаполнено(Представление) Тогда
		Представление = ПрикрепленныеФайлыСервер.ПредставлениеФайлаНаФорме(СпособОткрытия, НавигационнаяСсылка, Ложь);
	КонецЕсли;
	
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы



#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ок(Команда)
	
	СтруктураФайла = ПрикрепленныеФайлыКлиентСервер.НоваяСтруктураПрикрепляемогоФайла();
	ЗаполнитьЗначенияСвойств(СтруктураФайла, ЭтотОбъект, СтрокаСвойств());
	
	Закрыть(СтруктураФайла);
	
КонецПроцедуры



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаСвойств()

	Возврат "СпособОткрытия,Расширение,ПрикрепленныйФайл,Наименование,НавигационнаяСсылка,Комментарий,ДатаСоздания";

КонецФункции
 


#КонецОбласти