#Область ПрограммныйИнтерфейс

Процедура СериализоватьБазуВХМЛ(ЗаписьХМЛ) Экспорт
	
	ЗаписьХМЛ.ЗаписатьОбъявлениеXML();
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("data");
	ЗаписьХМЛ.ЗаписатьАтрибут("source", СтрШаблон("%1 ver: %2", Метаданные.Имя, Метаданные.Версия));
	
	ТипыМетаданных = Новый Массив(3);
	ТипыМетаданных[0] = Метаданные.Справочники;
	ТипыМетаданных[1] = Метаданные.Документы;
	ТипыМетаданных[2] = Метаданные.РегистрыСведений;
	
	Для каждого Метаданное Из ТипыМетаданных Цикл
		Для каждого ЭкзМетаданного Из Метаданное Цикл
			
			Если Метаданное = Метаданные.РегистрыСведений Тогда
				ДанныеДляВыгрузки = ЗапросПоНеобъектномуМетаданному(ЭкзМетаданного);
				ЗаписатьXML(ЗаписьХМЛ, ДанныеДляВыгрузки);
			Иначе
				ОбъектыДляВыгрузки = ЗапросПоОбъектномуМетаданному(ЭкзМетаданного);
				Для каждого СсылкаОбъекта Из ОбъектыДляВыгрузки Цикл
					ВыгружаемыйОбъект = СсылкаОбъекта.ПолучитьОбъект();
					ЗаписатьXML(ЗаписьХМЛ, ВыгружаемыйОбъект);
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ПрочитатьБазуИзХМЛ(ЧтениеХМЛ) Экспорт
	//Чт = Новый ЧтениеXML;
	ЧтениеХМЛ.Прочитать();
	ЧтениеХМЛ.Прочитать();
	Пока ВозможностьЧтенияXML(ЧтениеХМЛ) Цикл
		
		ДанныеДляЗагрузки = ПрочитатьXML(ЧтениеХМЛ);
		ДанныеДляЗагрузки.ОбменДанными.Загрузка = Истина;
	 	ДанныеДляЗагрузки.Записать();
		
	КонецЦикла
	
КонецПроцедуры

#КонецОбласти

#Область CлужебныеПроцедурыИФункции

Функция ЗапросПоОбъектномуМетаданному(Метаданное)
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	&ПолныйПутьКОбъекту КАК Таблица";
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&ПолныйПутьКОбъекту", Метаданное.ПолноеИмя());
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ЗапросПоНеобъектномуМетаданному(Метаданное)
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Метаданное.ПолноеИмя());
	НаборЗаписей = Менеджер.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей;
	
	//Запрос = Новый Запрос;
	//ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	*
	//|ИЗ
	//|	&ПолныйПутьКОбъекту КАК Таблица";
	//Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&ПолныйПутьКОбъекту", Метаданное.ПолноеИмя());
	//Возврат Запрос.Выполнить().Выгрузить();
	//
КонецФункции

#КонецОбласти