
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с формами
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ФорматДатыДокумента(Форма) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.Дата.Формат = "ДФ=dd/MM/yyyy";
	Элементы.Дата.ФорматРедактирования = "ДФ=dd/MM/yyyy";

КонецПроцедуры

Процедура ФорматДатыПроизвольнойФормы(Форма, ИмяРеквизита) Экспорт
	
	Элементы = Форма.Элементы;
	
	Элементы[ИмяРеквизита].Формат = "ДФ=dd/MM/yyyy";

КонецПроцедуры

#КонецОбласти