
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон(НСтр("ru = 'ТО №%1 от %2'; en = 'Car check №%1 dated %2'"), 
		Данные.ТекущийНомерТО, Формат(Данные.Дата, "ДФ=dd/MM/yyyy"));
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля = Новый Массив;
	Поля.Добавить("Дата");
	Поля.Добавить("ТекущийНомерТО");
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВидыТО() Экспорт
	
	ВидыТО = Новый Массив;
	ВидыТО.Добавить(ИмяПрошлогоТО());
	ВидыТО.Добавить(ИмяТекущееТО());
	ВидыТО.Добавить(ИмяСледующееТО());
	
	Возврат ВидыТО;
	
КонецФункции

Функция ИмяПрошлогоТО() Экспорт
	
	Возврат "ПрошлоеТО";
	
КонецФункции

Функция ИмяТекущееТО() Экспорт
	
	Возврат "ТекущееТО";
	
КонецФункции

Функция ИмяСледующееТО() Экспорт
	
	Возврат "СледующееТО";
	
КонецФункции

Функция ТаблицаПланТО(ДатаАнализа, Автомобиль = Неопределено) Экспорт
	
	Проверки.СвойствоЗаполнено(ДатаАнализа);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВлЗапрос.Интервал КАК Интервал,
	|	ВлЗапрос.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ВлЗапрос.ДатаПриобретения КАК ДатаПриобретения,
	|	ВлЗапрос.ТекущийНомерТО КАК НомерТОТекущий,
	|	ВлЗапрос.Автомобиль КАК Автомобиль,
	|	ВлЗапрос.Интервал / ВлЗапрос.МежсервисныйИнтервал КАК ИнтервалВнутригодовой
	|ПОМЕСТИТЬ ВлЗапрос
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВлЗапрос.Интервал КАК Интервал,
	|		ВлЗапрос.РегламентнаяРабота КАК РегламентнаяРабота,
	|		ВлЗапрос.ДатаПриобретения КАК ДатаПриобретения,
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(ВлЗапрос.ТекущийНомерТО КАК ЧИСЛО(13, 0))) = ВлЗапрос.ТекущийНомерТО
	|				ТОГДА ВлЗапрос.ТекущийНомерТО
	|			ИНАЧЕ ВЫРАЗИТЬ(ВлЗапрос.ТекущийНомерТО - 0.5 КАК ЧИСЛО(13, 0))
	|		КОНЕЦ КАК ТекущийНомерТО,
	|		ВлЗапрос.Автомобиль КАК Автомобиль,
	|		ВлЗапрос.МежсервисныйИнтервал КАК МежсервисныйИнтервал
	|	ИЗ
	|		(ВЫБРАТЬ
	|			АвтомобилиРегламентныеРаботы.Интервал КАК Интервал,
	|			АвтомобилиРегламентныеРаботы.РегламентнаяРабота КАК РегламентнаяРабота,
	|			НАЧАЛОПЕРИОДА(АвтомобилиРегламентныеРаботы.Ссылка.ДатаПриобретения, ДЕНЬ) КАК ДатаПриобретения,
	|			ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(АвтомобилиРегламентныеРаботы.Ссылка.ДатаПриобретения, ДЕНЬ), &ДатаАнализа, МЕСЯЦ) / АвтомобилиРегламентныеРаботы.Интервал КАК ЧИСЛО(10, 3)) КАК ТекущийНомерТО,
	|			АвтомобилиРегламентныеРаботы.Ссылка КАК Автомобиль,
	|			АвтомобилиРегламентныеРаботы.Ссылка.МежсервисныйИнтервал КАК МежсервисныйИнтервал
	|		ИЗ
	|			Справочник.Автомобили.РегламентныеРаботы КАК АвтомобилиРегламентныеРаботы
	|		ГДЕ
	|			(&Автомобиль = НЕОПРЕДЕЛЕНО
	|					ИЛИ АвтомобилиРегламентныеРаботы.Ссылка = &Автомобиль)) КАК ВлЗапрос) КАК ВлЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВлЗапрос.Интервал КАК Интервал,
	|	ВлЗапрос.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ВлЗапрос.ДатаПриобретения КАК ДатаПриобретения,
	|	ВлЗапрос.Автомобиль КАК Автомобиль,
	|	ВлЗапрос.НомерТОТекущий КАК НомерТОТекущий,
	|	ВлЗапрос.ИнтервалВнутригодовой КАК ИнтервалВнутригодовой,
	|	0 КАК Поле1
	|ПОМЕСТИТЬ ТОВнутригодовой
	|ИЗ
	|	ВлЗапрос КАК ВлЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВлЗапрос.Интервал,
	|	ВлЗапрос.РегламентнаяРабота,
	|	ВлЗапрос.ДатаПриобретения,
	|	ВлЗапрос.Автомобиль,
	|	ВлЗапрос.НомерТОТекущий - 1,
	|	ВлЗапрос.ИнтервалВнутригодовой,
	|	1
	|ИЗ
	|	ВлЗапрос КАК ВлЗапрос
	|ГДЕ
	|	ВлЗапрос.ИнтервалВнутригодовой <> (ВЫРАЗИТЬ(ВлЗапрос.ИнтервалВнутригодовой КАК ЧИСЛО(13, 0)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВлЗапрос.Автомобиль КАК Автомобиль,
	|	ВлЗапрос.ДатаПриобретения КАК ДатаПриобретения,
	|	ВлЗапрос.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ВлЗапрос.ДатаПриобретения, &ДатаАнализа, МЕСЯЦ) < ВлЗапрос.Интервал
	|			ТОГДА NULL
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВлЗапрос.ДатаПриобретения, МЕСЯЦ, (ВлЗапрос.НомерТОТекущий - 1) * ВлЗапрос.Интервал)
	|	КОНЕЦ КАК ПоПлану
	|ПОМЕСТИТЬ ТО_ПЛАН
	|ИЗ
	|	ТОВнутригодовой КАК ВлЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВлЗапрос.Автомобиль,
	|	ВлЗапрос.ДатаПриобретения,
	|	ВлЗапрос.РегламентнаяРабота,
	|	ВЫБОР
	|		КОГДА ВлЗапрос.НомерТОТекущий = 0
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВлЗапрос.ДатаПриобретения, МЕСЯЦ, ВлЗапрос.Интервал)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВлЗапрос.ДатаПриобретения, МЕСЯЦ, ВлЗапрос.НомерТОТекущий * ВлЗапрос.Интервал)
	|	КОНЕЦ
	|ИЗ
	|	ТОВнутригодовой КАК ВлЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВлЗапрос.Автомобиль,
	|	ВлЗапрос.ДатаПриобретения,
	|	ВлЗапрос.РегламентнаяРабота,
	|	ДОБАВИТЬКДАТЕ(ВлЗапрос.ДатаПриобретения, МЕСЯЦ, (ВлЗапрос.НомерТОТекущий + 1) * ВлЗапрос.Интервал)
	|ИЗ
	|	ТОВнутригодовой КАК ВлЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеДанныеТО.ТекущийНомерТО КАК ТекущийНомерТО,
	|	ТекущиеДанныеТО.ДатаПриобретенияАвто КАК ДатаПриобретенияАвто,
	|	ТекущиеДанныеТО.ТекущийНомерТО - 1 КАК ПрошлоеТОНомер,
	|	ДОБАВИТЬКДАТЕ(ТекущиеДанныеТО.ДатаПриобретенияАвто, МЕСЯЦ, 12 * (ТекущиеДанныеТО.ТекущийНомерТО - 1)) КАК ПрошлоеТОПоПлану,
	|	ТекущиеДанныеТО.ТекущийНомерТО КАК ТекущееТОНомер,
	|	ДОБАВИТЬКДАТЕ(ТекущиеДанныеТО.ДатаПриобретенияАвто, МЕСЯЦ, 12 * ТекущиеДанныеТО.ТекущийНомерТО) КАК ТекущееТОПоПлану,
	|	ТекущиеДанныеТО.ТекущийНомерТО + 1 КАК СледующееТОНомер,
	|	ДОБАВИТЬКДАТЕ(ТекущиеДанныеТО.ДатаПриобретенияАвто, МЕСЯЦ, 12 * (ТекущиеДанныеТО.ТекущийНомерТО + 1)) КАК СледующееТОПоПлану,
	|	ТекущиеДанныеТО.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ ИнтервалыПлан
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(ВлЗапрос.ТекущийНомерТО КАК ЧИСЛО(13, 0))) = ВлЗапрос.ТекущийНомерТО
	|				ТОГДА ВлЗапрос.ТекущийНомерТО
	|			ИНАЧЕ ВЫРАЗИТЬ(ВлЗапрос.ТекущийНомерТО - 0.5 КАК ЧИСЛО(13, 0))
	|		КОНЕЦ КАК ТекущийНомерТО,
	|		ВлЗапрос.ДатаПриобретенияАвто КАК ДатаПриобретенияАвто,
	|		ВлЗапрос.Автомобиль КАК Автомобиль
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫРАЗИТЬ(РАЗНОСТЬДАТ(Автомобили.ДатаПриобретения, &ДатаАнализа, МЕСЯЦ) / 12 КАК ЧИСЛО(10, 3)) КАК ТекущийНомерТО,
	|			Автомобили.ДатаПриобретения КАК ДатаПриобретенияАвто,
	|			Автомобили.Ссылка КАК Автомобиль
	|		ИЗ
	|			Справочник.Автомобили КАК Автомобили
	|		ГДЕ
	|			Автомобили.Ссылка = &Автомобиль) КАК ВлЗапрос) КАК ТекущиеДанныеТО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнтервалыПлан.Автомобиль КАК Автомобиль,
	|	ИнтервалыПлан.ДатаПриобретенияАвто КАК ДатаПриобретенияАвто,
	|	ИнтервалыПлан.ПрошлоеТОНомер КАК ПрошлоеТОНомер,
	|	ИнтервалыПлан.ТекущееТОНомер КАК ТекущееТОНомер,
	|	ИнтервалыПлан.СледующееТОНомер КАК СледующееТОНомер,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИнтервалыПлан.ПрошлоеТОПоПлану = ТО_ПЛАНТекущий.ПоПлану
	|				ТОГДА ТО_ПЛАНТекущий.ПоПлану
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ПрошлоеТОПоПлану,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИнтервалыПлан.ТекущееТОПоПлану = ТО_ПЛАНТекущий.ПоПлану
	|				ТОГДА ТО_ПЛАНТекущий.ПоПлану
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ТекущееТОПоПлану,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИнтервалыПлан.СледующееТОПоПлану = ТО_ПЛАНТекущий.ПоПлану
	|				ТОГДА ТО_ПЛАНТекущий.ПоПлану
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК СледующееТОПоПлану,
	|	ТО_ПЛАНТекущий.РегламентнаяРабота КАК РегламентнаяРабота
	|ПОМЕСТИТЬ ИнтервалыТООтбор
	|ИЗ
	|	ИнтервалыПлан КАК ИнтервалыПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТО_ПЛАН КАК ТО_ПЛАНТекущий
	|		ПО ИнтервалыПлан.Автомобиль = ТО_ПЛАНТекущий.Автомобиль
	|			И (ИнтервалыПлан.ПрошлоеТОПоПлану = ТО_ПЛАНТекущий.ПоПлану
	|				ИЛИ ИнтервалыПлан.ТекущееТОПоПлану = ТО_ПЛАНТекущий.ПоПлану
	|				ИЛИ ИнтервалыПлан.СледующееТОПоПлану = ТО_ПЛАНТекущий.ПоПлану)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИнтервалыПлан.Автомобиль,
	|	ИнтервалыПлан.ДатаПриобретенияАвто,
	|	ИнтервалыПлан.ПрошлоеТОНомер,
	|	ИнтервалыПлан.ТекущееТОНомер,
	|	ИнтервалыПлан.СледующееТОНомер,
	|	ТО_ПЛАНТекущий.РегламентнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнтервалыТООтбор.Автомобиль КАК Автомобиль,
	|	ИнтервалыТООтбор.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ИнтервалыТООтбор.ПрошлоеТОПоПлану КАК ПрошлоеТОПоПлану,
	|	ТОПрошлые.ПоФакту КАК ПрошлоеТОПоФакту,
	|	ТОПрошлые.СтатусТО КАК ПрошлоеТОСтатус,
	|	ИнтервалыТООтбор.ПрошлоеТОНомер КАК ПрошлоеТОНомер,
	|	ТОПрошлые.Сумма КАК ПрошлоеТОСумма,
	|	ИнтервалыТООтбор.ТекущееТОПоПлану КАК ТекущееТОПоПлану,
	|	ТОТекущие.ПоФакту КАК ТекущееТОПоФакту,
	|	ИнтервалыТООтбор.ТекущееТОНомер КАК ТекущееТОНомер,
	|	ТОТекущие.СтатусТО КАК ТекущееТОСтатус,
	|	ТОТекущие.Сумма КАК ТекущееТОСумма,
	|	ИнтервалыТООтбор.СледующееТОПоПлану КАК СледующееТОПоПлану,
	|	ТОСледующие.ПоФакту КАК СледующееТОПоФакту,
	|	ИнтервалыТООтбор.СледующееТОНомер КАК СледующееТОНомер,
	|	ТОСледующие.СтатусТО КАК СледующееТОСтатус,
	|	ТОСледующие.Сумма КАК СледующееТОСумма,
	|	ТОПрошлые.Внеплановое КАК ПрошлоеТОВнеплановое,
	|	ТОСледующие.Внеплановое КАК СледующееТОВнеплановое,
	|	ТОТекущие.Внеплановое КАК ТекущееТОВнеплановое
	|ИЗ
	|	ИнтервалыТООтбор КАК ИнтервалыТООтбор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеТО КАК ТОПрошлые
	|		ПО ИнтервалыТООтбор.Автомобиль = ТОПрошлые.Автомобиль
	|			И ИнтервалыТООтбор.ПрошлоеТОПоПлану = ТОПрошлые.Период
	|			И ИнтервалыТООтбор.РегламентнаяРабота = ТОПрошлые.РегламентнаяРабота
	|			И (ТОПрошлые.Внеплановое = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеТО КАК ТОТекущие
	|		ПО ИнтервалыТООтбор.Автомобиль = ТОТекущие.Автомобиль
	|			И ИнтервалыТООтбор.ТекущееТОПоПлану = ТОТекущие.Период
	|			И ИнтервалыТООтбор.РегламентнаяРабота = ТОТекущие.РегламентнаяРабота
	|			И (ТОТекущие.Внеплановое = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеТО КАК ТОСледующие
	|		ПО ИнтервалыТООтбор.Автомобиль = ТОСледующие.Автомобиль
	|			И ИнтервалыТООтбор.СледующееТОПоПлану = ТОСледующие.Период
	|			И ИнтервалыТООтбор.РегламентнаяРабота = ТОСледующие.РегламентнаяРабота
	|			И (ТОСледующие.Внеплановое = ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗарегистрированныеТО.Автомобиль,
	|	ЗарегистрированныеТО.РегламентнаяРабота,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ПрошлоеТОПоПлану = ЗарегистрированныеТО.Период
	|			ТОГДА ЗарегистрированныеТО.Период
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ПрошлоеТОПоПлану = ЗарегистрированныеТО.Период
	|			ТОГДА ЗарегистрированныеТО.ПоФакту
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ПрошлоеТОПоПлану = ЗарегистрированныеТО.Период
	|			ТОГДА ЗарегистрированныеТО.СтатусТО
	|	КОНЕЦ,
	|	ИнтервалыПлан.ПрошлоеТОНомер,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ПрошлоеТОПоПлану = ЗарегистрированныеТО.Период
	|			ТОГДА ЗарегистрированныеТО.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ТекущееТОПоПлану = ЗарегистрированныеТО.Период
	|			ТОГДА ЗарегистрированныеТО.Период
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ТекущееТОПоПлану = ЗарегистрированныеТО.Период
	|			ТОГДА ЗарегистрированныеТО.ПоФакту
	|	КОНЕЦ,
	|	ИнтервалыПлан.ТекущееТОНомер,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ТекущееТОПоПлану = ЗарегистрированныеТО.Период
	|			ТОГДА ЗарегистрированныеТО.СтатусТО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ТекущееТОПоПлану = ЗарегистрированныеТО.Период
	|			ТОГДА ЗарегистрированныеТО.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.СледующееТОПоПлану = ЗарегистрированныеТО.Период
	|			ТОГДА ЗарегистрированныеТО.Период
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.СледующееТОПоПлану = ЗарегистрированныеТО.Период
	|			ТОГДА ЗарегистрированныеТО.ПоФакту
	|	КОНЕЦ,
	|	ИнтервалыПлан.СледующееТОНомер,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.СледующееТОПоПлану = ЗарегистрированныеТО.Период
	|			ТОГДА ЗарегистрированныеТО.СтатусТО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.СледующееТОПоПлану = ЗарегистрированныеТО.Период
	|			ТОГДА ЗарегистрированныеТО.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ПрошлоеТОПоПлану = ЗарегистрированныеТО.Период
	|			ТОГДА ЗарегистрированныеТО.Внеплановое
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.СледующееТОПоПлану = ЗарегистрированныеТО.Период
	|			ТОГДА ЗарегистрированныеТО.Внеплановое
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ТекущееТОПоПлану = ЗарегистрированныеТО.Период
	|			ТОГДА ЗарегистрированныеТО.Внеплановое
	|	КОНЕЦ
	|ИЗ
	|	ИнтервалыПлан КАК ИнтервалыПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеТО КАК ЗарегистрированныеТО
	|		ПО ИнтервалыПлан.Автомобиль = ЗарегистрированныеТО.Автомобиль
	|			И (ИнтервалыПлан.ПрошлоеТОПоПлану = ЗарегистрированныеТО.Период
	|				ИЛИ ИнтервалыПлан.ТекущееТОПоПлану = ЗарегистрированныеТО.Период
	|				ИЛИ ИнтервалыПлан.СледующееТОПоПлану = ЗарегистрированныеТО.Период)
	|			И (ЗарегистрированныеТО.Внеплановое = ИСТИНА)");
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ДатаАнализа", ДатаАнализа);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТаблицаПланТОПробег(Пробег, Автомобиль = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВлЗапрос.Интервал КАК Интервал,
	|	ВлЗапрос.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ВлЗапрос.ДатаПриобретения КАК ДатаПриобретения,
	|	ВлЗапрос.ТекущийНомерТО КАК НомерТОТекущий,
	|	ВлЗапрос.Автомобиль КАК Автомобиль,
	|	ВлЗапрос.Интервал / ВлЗапрос.МежсервисныйИнтервал КАК ИнтервалВнутригодовой
	|ПОМЕСТИТЬ ВлЗапрос
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВлЗапрос.Интервал КАК Интервал,
	|		ВлЗапрос.РегламентнаяРабота КАК РегламентнаяРабота,
	|		ВлЗапрос.ДатаПриобретения КАК ДатаПриобретения,
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(ВлЗапрос.ТекущийНомерТО КАК ЧИСЛО(13, 0))) = ВлЗапрос.ТекущийНомерТО
	|				ТОГДА ВлЗапрос.ТекущийНомерТО
	|			ИНАЧЕ ВЫРАЗИТЬ(ВлЗапрос.ТекущийНомерТО - 0.5 КАК ЧИСЛО(13, 0))
	|		КОНЕЦ КАК ТекущийНомерТО,
	|		ВлЗапрос.Автомобиль КАК Автомобиль,
	|		ВлЗапрос.МежсервисныйИнтервал КАК МежсервисныйИнтервал
	|	ИЗ
	|		(ВЫБРАТЬ
	|			АвтомобилиРегламентныеРаботы.Интервал КАК Интервал,
	|			АвтомобилиРегламентныеРаботы.РегламентнаяРабота КАК РегламентнаяРабота,
	|			НАЧАЛОПЕРИОДА(АвтомобилиРегламентныеРаботы.Ссылка.ДатаПриобретения, ДЕНЬ) КАК ДатаПриобретения,
	|			ВЫРАЗИТЬ(&Пробег / АвтомобилиРегламентныеРаботы.Интервал КАК ЧИСЛО(10, 3)) КАК ТекущийНомерТО,
	|			АвтомобилиРегламентныеРаботы.Ссылка КАК Автомобиль,
	|			АвтомобилиРегламентныеРаботы.Ссылка.МежсервисныйИнтервал КАК МежсервисныйИнтервал
	|		ИЗ
	|			Справочник.Автомобили.РегламентныеРаботы КАК АвтомобилиРегламентныеРаботы
	|		ГДЕ
	|			(&Автомобиль = НЕОПРЕДЕЛЕНО
	|					ИЛИ АвтомобилиРегламентныеРаботы.Ссылка = &Автомобиль)) КАК ВлЗапрос) КАК ВлЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВлЗапрос.Интервал КАК Интервал,
	|	ВлЗапрос.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ВлЗапрос.ДатаПриобретения КАК ДатаПриобретения,
	|	ВлЗапрос.Автомобиль КАК Автомобиль,
	|	ВлЗапрос.НомерТОТекущий КАК НомерТОТекущий,
	|	ВлЗапрос.ИнтервалВнутригодовой КАК ИнтервалВнутригодовой,
	|	0 КАК Поле1
	|ПОМЕСТИТЬ ТОВнутригодовой
	|ИЗ
	|	ВлЗапрос КАК ВлЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВлЗапрос.Интервал,
	|	ВлЗапрос.РегламентнаяРабота,
	|	ВлЗапрос.ДатаПриобретения,
	|	ВлЗапрос.Автомобиль,
	|	ВлЗапрос.НомерТОТекущий - 1,
	|	ВлЗапрос.ИнтервалВнутригодовой,
	|	1
	|ИЗ
	|	ВлЗапрос КАК ВлЗапрос
	|ГДЕ
	|	ВлЗапрос.ИнтервалВнутригодовой <> (ВЫРАЗИТЬ(ВлЗапрос.ИнтервалВнутригодовой КАК ЧИСЛО(13, 0)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВлЗапрос.Автомобиль КАК Автомобиль,
	|	ВлЗапрос.ДатаПриобретения КАК ДатаПриобретения,
	|	ВлЗапрос.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ВЫБОР
	|		КОГДА &Пробег < ВлЗапрос.Интервал
	|			ТОГДА NULL
	|		ИНАЧЕ (ВлЗапрос.НомерТОТекущий - 1) * ВлЗапрос.Интервал
	|	КОНЕЦ КАК ПоПлану
	|ПОМЕСТИТЬ ТО_ПЛАН
	|ИЗ
	|	ТОВнутригодовой КАК ВлЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВлЗапрос.Автомобиль,
	|	ВлЗапрос.ДатаПриобретения,
	|	ВлЗапрос.РегламентнаяРабота,
	|	ВЫБОР
	|		КОГДА ВлЗапрос.НомерТОТекущий = 0
	|			ТОГДА ВлЗапрос.Интервал
	|		ИНАЧЕ ВлЗапрос.НомерТОТекущий * ВлЗапрос.Интервал
	|	КОНЕЦ
	|ИЗ
	|	ТОВнутригодовой КАК ВлЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВлЗапрос.Автомобиль,
	|	ВлЗапрос.ДатаПриобретения,
	|	ВлЗапрос.РегламентнаяРабота,
	|	(ВлЗапрос.НомерТОТекущий + 1) * ВлЗапрос.Интервал
	|ИЗ
	|	ТОВнутригодовой КАК ВлЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеДанныеТО.ТекущийНомерТО КАК ТекущийНомерТО,
	|	ТекущиеДанныеТО.ДатаПриобретенияАвто КАК ДатаПриобретенияАвто,
	|	ТекущиеДанныеТО.ТекущийНомерТО - 1 КАК ПрошлоеТОНомер,
	|	ТекущиеДанныеТО.Автомобиль.МежсервисныйИнтервал * (ТекущиеДанныеТО.ТекущийНомерТО - 1) КАК ПрошлоеТОПоПлану,
	|	ТекущиеДанныеТО.ТекущийНомерТО КАК ТекущееТОНомер,
	|	ТекущиеДанныеТО.Автомобиль.МежсервисныйИнтервал * ТекущиеДанныеТО.ТекущийНомерТО КАК ТекущееТОПоПлану,
	|	ТекущиеДанныеТО.ТекущийНомерТО + 1 КАК СледующееТОНомер,
	|	ТекущиеДанныеТО.Автомобиль.МежсервисныйИнтервал * (ТекущиеДанныеТО.ТекущийНомерТО + 1) КАК СледующееТОПоПлану,
	|	ТекущиеДанныеТО.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ ИнтервалыПлан
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(ВлЗапрос.ТекущийНомерТО КАК ЧИСЛО(13, 0))) = ВлЗапрос.ТекущийНомерТО
	|				ТОГДА ВлЗапрос.ТекущийНомерТО
	|			ИНАЧЕ ВЫРАЗИТЬ(ВлЗапрос.ТекущийНомерТО - 0.5 КАК ЧИСЛО(13, 0))
	|		КОНЕЦ КАК ТекущийНомерТО,
	|		ВлЗапрос.ДатаПриобретенияАвто КАК ДатаПриобретенияАвто,
	|		ВлЗапрос.Автомобиль КАК Автомобиль
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫРАЗИТЬ(&Пробег / Автомобили.МежсервисныйИнтервал КАК ЧИСЛО(10, 3)) КАК ТекущийНомерТО,
	|			Автомобили.ДатаПриобретения КАК ДатаПриобретенияАвто,
	|			Автомобили.Ссылка КАК Автомобиль
	|		ИЗ
	|			Справочник.Автомобили КАК Автомобили
	|		ГДЕ
	|			Автомобили.Ссылка = &Автомобиль) КАК ВлЗапрос) КАК ТекущиеДанныеТО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнтервалыПлан.Автомобиль КАК Автомобиль,
	|	ИнтервалыПлан.ДатаПриобретенияАвто КАК ДатаПриобретенияАвто,
	|	ИнтервалыПлан.ПрошлоеТОНомер КАК ПрошлоеТОНомер,
	|	ИнтервалыПлан.ТекущееТОНомер КАК ТекущееТОНомер,
	|	ИнтервалыПлан.СледующееТОНомер КАК СледующееТОНомер,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИнтервалыПлан.ПрошлоеТОПоПлану = ТО_ПЛАНТекущий.ПоПлану
	|				ТОГДА ТО_ПЛАНТекущий.ПоПлану
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПрошлоеТОПоПлану,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИнтервалыПлан.ТекущееТОПоПлану = ТО_ПЛАНТекущий.ПоПлану
	|				ТОГДА ТО_ПЛАНТекущий.ПоПлану
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ТекущееТОПоПлану,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИнтервалыПлан.СледующееТОПоПлану = ТО_ПЛАНТекущий.ПоПлану
	|				ТОГДА ТО_ПЛАНТекущий.ПоПлану
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СледующееТОПоПлану,
	|	ТО_ПЛАНТекущий.РегламентнаяРабота КАК РегламентнаяРабота
	|ПОМЕСТИТЬ ИнтервалыТООтбор
	|ИЗ
	|	ИнтервалыПлан КАК ИнтервалыПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТО_ПЛАН КАК ТО_ПЛАНТекущий
	|		ПО ИнтервалыПлан.Автомобиль = ТО_ПЛАНТекущий.Автомобиль
	|			И (ИнтервалыПлан.ПрошлоеТОПоПлану = ТО_ПЛАНТекущий.ПоПлану
	|				ИЛИ ИнтервалыПлан.ТекущееТОПоПлану = ТО_ПЛАНТекущий.ПоПлану
	|				ИЛИ ИнтервалыПлан.СледующееТОПоПлану = ТО_ПЛАНТекущий.ПоПлану)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИнтервалыПлан.Автомобиль,
	|	ИнтервалыПлан.ДатаПриобретенияАвто,
	|	ИнтервалыПлан.ПрошлоеТОНомер,
	|	ИнтервалыПлан.ТекущееТОНомер,
	|	ИнтервалыПлан.СледующееТОНомер,
	|	ТО_ПЛАНТекущий.РегламентнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнтервалыТООтбор.Автомобиль КАК Автомобиль,
	|	ИнтервалыТООтбор.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ИнтервалыТООтбор.ПрошлоеТОПоПлану КАК ПрошлоеТОПоПлану,
	|	ТОПрошлые.ПоФакту КАК ПрошлоеТОПоФакту,
	|	ТОПрошлые.СтатусТО КАК ПрошлоеТОСтатус,
	|	ИнтервалыТООтбор.ПрошлоеТОНомер КАК ПрошлоеТОНомер,
	|	ТОПрошлые.Сумма КАК ПрошлоеТОСумма,
	|	ИнтервалыТООтбор.ТекущееТОПоПлану КАК ТекущееТОПоПлану,
	|	ТОТекущие.ПоФакту КАК ТекущееТОПоФакту,
	|	ИнтервалыТООтбор.ТекущееТОНомер КАК ТекущееТОНомер,
	|	ТОТекущие.СтатусТО КАК ТекущееТОСтатус,
	|	ТОТекущие.Сумма КАК ТекущееТОСумма,
	|	ИнтервалыТООтбор.СледующееТОПоПлану КАК СледующееТОПоПлану,
	|	ТОСледующие.ПоФакту КАК СледующееТОПоФакту,
	|	ИнтервалыТООтбор.СледующееТОНомер КАК СледующееТОНомер,
	|	ТОСледующие.СтатусТО КАК СледующееТОСтатус,
	|	ТОСледующие.Сумма КАК СледующееТОСумма,
	|	ТОПрошлые.Внеплановое КАК ПрошлоеТОВнеплановое,
	|	ТОСледующие.Внеплановое КАК СледующееТОВнеплановое,
	|	ТОТекущие.Внеплановое КАК ТекущееТОВнеплановое
	|ИЗ
	|	ИнтервалыТООтбор КАК ИнтервалыТООтбор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеТО КАК ТОПрошлые
	|		ПО ИнтервалыТООтбор.Автомобиль = ТОПрошлые.Автомобиль
	|			И ИнтервалыТООтбор.ПрошлоеТОПоПлану = ТОПрошлые.ПоПлану
	|			И ИнтервалыТООтбор.РегламентнаяРабота = ТОПрошлые.РегламентнаяРабота
	|			И (ТОПрошлые.Внеплановое = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеТО КАК ТОТекущие
	|		ПО ИнтервалыТООтбор.Автомобиль = ТОТекущие.Автомобиль
	|			И ИнтервалыТООтбор.ТекущееТОПоПлану = ТОТекущие.ПоПлану
	|			И ИнтервалыТООтбор.РегламентнаяРабота = ТОТекущие.РегламентнаяРабота
	|			И (ТОТекущие.Внеплановое = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеТО КАК ТОСледующие
	|		ПО ИнтервалыТООтбор.Автомобиль = ТОСледующие.Автомобиль
	|			И ИнтервалыТООтбор.СледующееТОПоПлану = ТОСледующие.ПоПлану
	|			И ИнтервалыТООтбор.РегламентнаяРабота = ТОСледующие.РегламентнаяРабота
	|			И (ТОСледующие.Внеплановое = ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗарегистрированныеТО.Автомобиль,
	|	ЗарегистрированныеТО.РегламентнаяРабота,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ПрошлоеТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|			ТОГДА ЗарегистрированныеТО.ПоПлану
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ПрошлоеТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|			ТОГДА ЗарегистрированныеТО.ПоФакту
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ПрошлоеТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|			ТОГДА ЗарегистрированныеТО.СтатусТО
	|	КОНЕЦ,
	|	ИнтервалыПлан.ПрошлоеТОНомер,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ПрошлоеТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|			ТОГДА ЗарегистрированныеТО.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ТекущееТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|			ТОГДА ЗарегистрированныеТО.ПоПлану
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ТекущееТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|			ТОГДА ЗарегистрированныеТО.ПоФакту
	|	КОНЕЦ,
	|	ИнтервалыПлан.ТекущееТОНомер,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ТекущееТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|			ТОГДА ЗарегистрированныеТО.СтатусТО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ТекущееТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|			ТОГДА ЗарегистрированныеТО.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.СледующееТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|			ТОГДА ЗарегистрированныеТО.ПоПлану
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.СледующееТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|			ТОГДА ЗарегистрированныеТО.ПоФакту
	|	КОНЕЦ,
	|	ИнтервалыПлан.СледующееТОНомер,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.СледующееТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|			ТОГДА ЗарегистрированныеТО.СтатусТО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.СледующееТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|			ТОГДА ЗарегистрированныеТО.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ПрошлоеТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|			ТОГДА ЗарегистрированныеТО.Внеплановое
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.СледующееТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|			ТОГДА ЗарегистрированныеТО.Внеплановое
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИнтервалыПлан.ТекущееТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|			ТОГДА ЗарегистрированныеТО.Внеплановое
	|	КОНЕЦ
	|ИЗ
	|	ИнтервалыПлан КАК ИнтервалыПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеТО КАК ЗарегистрированныеТО
	|		ПО ИнтервалыПлан.Автомобиль = ЗарегистрированныеТО.Автомобиль
	|			И (ИнтервалыПлан.ПрошлоеТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|				ИЛИ ИнтервалыПлан.ТекущееТОПоПлану = ЗарегистрированныеТО.ПоПлану
	|				ИЛИ ИнтервалыПлан.СледующееТОПоПлану = ЗарегистрированныеТО.ПоПлану)
	|			И (ЗарегистрированныеТО.Внеплановое = ИСТИНА)");
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("Пробег", Пробег);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДатаТОПоИнтервалу(ДатаПриобретения = Неопределено, ВидТО, ДатаДокумента) Экспорт
	
	Если ДатаПриобретения = Неопределено Тогда
		ДатаПриобретения = ДатаДокумента;
	КонецЕсли;
	
	ДатаАнализа = Дата(Год(ДатаДокумента), Месяц(ДатаПриобретения), День(ДатаПриобретения));
	
	Если ВидТО = ИмяТекущееТО() Тогда
		Если ДатаДокумента >= ДатаАнализа Тогда
			Возврат ДатаАнализа;
		Иначе
			Возврат НачалоГода(ДатаАнализа) - 1
		КонецЕсли;
	ИначеЕсли ВидТО = ИмяСледующееТО() Тогда
		СледующийГодДатаАнализа = ДобавитьМесяц(ДатаАнализа, 12);
		СледующийГодДатаДокумента = ДобавитьМесяц(ДатаДокумента, 12);
		Если СледующийГодДатаДокумента >= СледующийГодДатаАнализа Тогда
			Возврат СледующийГодДатаАнализа;
		Иначе
			Возврат НачалоГода(СледующийГодДатаАнализа) - 1;
		КонецЕсли;
	ИначеЕсли ВидТО = ИмяПрошлогоТО() Тогда
		КонецПрошлыйГодДатаАнализа = ДобавитьМесяц(ДатаАнализа, -12);
		КонецПрошлыйГодДатаДокумента = ДобавитьМесяц(ДатаДокумента, -12);
		Если КонецПрошлыйГодДатаДокумента >= КонецПрошлыйГодДатаАнализа Тогда
			Возврат КонецПрошлыйГодДатаАнализа;
		Иначе
			Возврат НачалоГода(КонецПрошлыйГодДатаАнализа) - 1;
		КонецЕсли;
	КонецЕсли;
	
	ВызватьИсключение "Not implemented";
	
КонецФункции

Функция ПробегТОПоИнтервалу(ВидТО, ТекущийНомерТО, МежсервисныйИнтервал, ТекущийПробег) Экспорт
	
	Если ВидТО = ИмяТекущееТО() Тогда
		Возврат ТекущийНомерТО * МежсервисныйИнтервал;
	ИначеЕсли ВидТО = ИмяСледующееТО() Тогда
		Возврат (ТекущийНомерТО + 1) * МежсервисныйИнтервал;
	ИначеЕсли ВидТО = ИмяПрошлогоТО() Тогда
		Возврат (ТекущийНомерТО - 1) * МежсервисныйИнтервал;
	КонецЕсли;
	
	ВызватьИсключение "Not implemented";
	
КонецФункции

#КонецОбласти
