
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Для Каждого ТекСтрока Из ВыполненныеРаботы Цикл
		Для каждого ВилТО Из Документы.РегистрацииТО.ПолучитьВидыТО() Цикл
				
			Набор = РегистрыСведений.ЗарегистрированныеТО.СоздатьНаборЗаписей();
			Набор.Отбор.Автомобиль.Установить(Автомобиль);
			Набор.Отбор.РегламентнаяРабота.Установить(ТекСтрока.РегламентнаяРабота);
			Набор.Отбор.НомерТО.Установить(ТекСтрока[ВилТО + "Номер"]);
			Набор.Прочитать();
			Набор.Очистить();
			
			Если ТекСтрока[ВилТО + "Статус"] = Перечисления.СтатусыВыполненияТО.Пройдено
				И ЗначениеЗаполнено(ТекСтрока[ВилТО + "ПоФакту"]) Тогда

				Движение = Набор.Добавить();
				Движение.Период = ТекСтрока[ВилТО + "ПоФакту"];
				Движение.Автомобиль = Автомобиль;
				Движение.РегламентнаяРабота = ТекСтрока.РегламентнаяРабота;
				Движение.СтатусТО = ТекСтрока[ВилТО + "Статус"];
				Движение.НомерТО = ТекСтрока[ВилТО + "Номер"];
				
			КонецЕсли;
			
			Набор.Записать(Истина);;
			
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Для Каждого ТекСтрока Из ВыполненныеРаботы Цикл
		Для каждого ВилТО Из Документы.РегистрацииТО.ПолучитьВидыТО() Цикл
			Если ЗначениеЗаполнено(ТекСтрока[ВилТО + "ПоФакту"]) Тогда

				Набор = РегистрыСведений.ЗарегистрированныеТО.СоздатьНаборЗаписей();
				Набор.Отбор.Автомобиль.Установить(Автомобиль);
				Набор.Отбор.РегламентнаяРабота.Установить(ТекСтрока.РегламентнаяРабота);
				Набор.Отбор.НомерТО.Установить(ТекСтрока[ВилТО + "Номер"]);
				Набор.Прочитать();
				Набор.Очистить();
				
				Набор.Записать(Истина);
			
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти