
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЗарегистрированныеТО.Записывать = Истина;
	Для Каждого ТекСтрока Из ВыполненныеРаботы Цикл
		Если ТекСтрока.СтатусТекущегоТО = Перечисления.СтатусыВыполненияТО.Пройдено Тогда
			Движение = Движения.ЗарегистрированныеТО.Добавить();
			Движение.Период = Дата;
			Движение.Автомобиль = Автомобиль;
			Движение.РегламентнаяРабота = ТекСтрока.РегламентнаяРабота;
			Движение.СтатусТО = ТекСтрока.СтатусТекущегоТО;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
