
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Форма = ПараметрыВыполненияКоманды.Источник;
	Если ТипЗнч(Форма) = Тип("УправляемаяФорма") Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", Форма);
		Оповещение = Новый ОписаниеОповещения("ЗакрытиеСпискаПрикрепленныхФайлов", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыФормы = Новый Структура("СписокФайлов", Форма.Медиафайлы);
		ОткрытьФорму("РегистрСведений.ПринадлежностьФайлов.Форма.СписокФайловОбъекта", ПараметрыФормы, Форма, Истина, , , Оповещение);	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеСпискаПрикрепленныхФайлов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		// Обработка, общая для всех форм объектов
		ДополнительныеПараметры.Форма.Медиафайлы = Результат;
		ПрикрепленныеФайлыКлиентСервер.ОбновитьПредставлениеМедиафайлов(ДополнительныеПараметры.Форма);
		ДополнительныеПараметры.Форма.Модифицированность = Истина;
		
		// Обповещение для выполнения дополнительной обработки события
		Оповестить(ПрикрепленныеФайлыКлиент.ИмяСобытияИзменениеСпискаМультимедиа(), Результат, ДополнительныеПараметры.Форма);
		
	КонецЕсли;
	
КонецПроцедуры
