////////////////////////////////////////////////////////////////////////////////
// Обновление базы при переходе на новый релиз. Клиентские процедуры
//
////////////////////////////////////////////////////////////////////////////////

// Выполняется при запуске приложения для проверки и установки обновлений ИБ
Процедура ПроверитьЗапуститьОбновление() Экспорт
	
	ЭтоПервыйЗапуск = ОбновлениеИнформационнойБазыВызовСервера.ЭтоПервыйЗапуск();
	
	Если ЭтоПервыйЗапуск Тогда
		
		ОткрытьФорму("ОбщаяФорма.ОжиданиеДлительнойОперации");
		
	КонецЕсли;
	
КонецПроцедуры
