
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	
	Если (ИмяСобытия = ПрикрепленныеФайлыКлиент.ИмяСобытияГенерацииМультимедиа()) И (Источник = ЭтаФорма) Тогда
		ОбработатьДанныеМультимедиа(Параметр);	
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обрабатывает и записывает данные мультимедиа в БД
//
// Параметры:
//  ПакетМультимедиа		 - Структура - упакованные данные мультимедиа (см. ПрикрепленныеФайлыКлиент.УпаковатьДанныеМультимедиа)
//
&НаСервереБезКонтекста
Процедура ОбработатьДанныеМультимедиа(ПакетМультимедиа)
	
	ПрикрепленныеФайлыСервер.ЗаписатьДанныеМультимедиа(ПакетМультимедиа);		
	
КонецПроцедуры

#КонецОбласти