
&НаКлиенте
// На мобильном приложении текущая строка теряется, поэтому сохраняем в переменной
Перем ТекСтрокаХарактеристики;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Характеристики.Сортировать("Характеристика");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТЧХарактеристики

&НаКлиенте
Процедура ДобавитьХарактеристику(Команда)
	ТекСтрокаХарактеристики = Неопределено;
	ОткрытьФормуВыбораХарактеристики();
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрокаХарактеристики = Неопределено Тогда
		ТекСтрока = Объект.Характеристики.Добавить();
		Элементы.Характеристики.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	Иначе
		ТекСтрока = ТекСтрокаХарактеристики;
	КонецЕсли;
	Элементы.Характеристики.ТекущийЭлемент = Неопределено;
	ТекСтрока.Характеристика = ВыбранноеЗначение;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФормы

&НаКлиенте
Процедура ОткрытьФормуВыбораХарактеристики()
	
	ОткрытьФорму("Справочник.ФизическиеХарактеристики.ФормаВыбора",, Элементы.Характеристики);
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтрокаХарактеристики = Элементы.Характеристики.ТекущиеДанные;
	ОткрытьФормуВыбораХарактеристики();
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Сообщить("Attention. You enter edit mode. This mode is not available on desktop. Check it out carefully!");
	
КонецПроцедуры

#КонецОбласти