
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьНачальнуюСтраницу" Тогда
		ЗаполнитьТаблицуОпераций();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовКомандФормы

&НаКлиенте
Процедура ТаблицаОперацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаКоманды = ТаблицаОперации.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаЗакрытияДиалогов", ЭтотОбъект);
	
	ИмяФормыОбработки = СтрокаКоманды.Ключ;
	ПараметрыФормы = Новый Структура;
	
	ОткрытьФорму(ИмяФормыОбработки, ПараметрыФормы, ЭтотОбъект, , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура Сервис(Команда)
	ОткрытьФорму("Обработка.НастройкиПрограммы.Форма");
КонецПроцедуры

&НаКлиенте
Процедура НоваяОперация(Команда)
	ОткрытьФорму("Справочник.Проекты.ФормаОбъекта",, ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонвертациюЕдИзм(Команда)
	ОткрытьФорму("Обработка.НачальнаяСтраница.Форма.ФормаКонвертацииЕдиницИзмерения");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуОпераций()
	
	ТаблицаОперации.Очистить();
	
	МетаданныеОпераций = Новый Массив;
	МетаданныеОпераций.Добавить(Метаданные.Справочники.Проекты);
	МетаданныеОпераций.Добавить(Метаданные.ЖурналыДокументов.РемонтыАвто);
	МетаданныеОпераций.Добавить(Метаданные.Документы.Блокнот);
	
	Для каждого ОперацияМетаданного Из МетаданныеОпераций Цикл
		
		НоваяСтрока           = ТаблицаОперации.Добавить();
		НоваяСтрока.Ключ      = ОперацияМетаданного.Формы.ФормаСписка.ПолноеИмя();
		НоваяСтрока.Заголовок = ОперацияМетаданного.Синоним;
		
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОперацияМетаданного.ПолноеИмя());
		
		Показатели = Менеджер.ОтчетныеПоказатели();
		
		Счетчик = 1;
		Для каждого СтрокаПоказателя Из Показатели Цикл
			Если Счетчик > МаксимумПоказателейСтроки() Тогда
				Прервать;
			КонецЕсли;
			НоваяСтрока["НаименованиеПоказателя" + Счетчик] = СтрокаПоказателя.Ключ;
			НоваяСтрока["ЗначениеПоказателя" + Счетчик] = СтрокаПоказателя.Значение;
			Счетчик = Счетчик + 1;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция МаксимумПоказателейСтроки()
	Возврат 3;
КонецФункции

&НаКлиенте
Процедура ОбработкаЗакрытияДиалогов(Результат, ДополнительныеПараметры) Экспорт
	
	// срабатывает после закрытия форм конкретных операций;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОпераций(Команда)
	ОткрытьФорму("Обработка.НастройкиПрограммы.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ТестПервыйЗапуск(Команда)
	УстКонстанту();
КонецПроцедуры

Процедура УстКонстанту()

	Константы.ПервоначальноеЗаполнениеПройдено.Установить(ЛОжь);

КонецПроцедуры


#КонецОбласти