
////////////////////////////////////////////////////////////////////////////////
// Модуль ДанныеИБ содержит единую точку для получение фиксированныъ данных ИБ.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Каталог, испоьзуемый для обмена фото с другими приложениями.
// 
// Возвращаемое значение:
//  Строка - Uri к каталогу
//
Функция КаталогФото() Экспорт
	
	Возврат Константы.КаталогФото.Получить();
	
КонецФункции

// Каталог, используемый для обмена изображениями с другими приложениями 
// 
// Возвращаемое значение:
//  Строка - Uri к каталогу
//
Функция КаталогКартинок() Экспорт
	
	Возврат Константы.КаталогКартинок.Получить();
	
КонецФункции

#КонецОбласти