Перем КонтекстЯдра;
Перем Ожидаем;

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	
КонецПроцедуры

Функция ПолучитьСписокТестов() Экспорт
	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестПересчитатьЕдиницуИзмерения");
	ВсеТесты.Добавить("ТестКонвертироватьТипЧисло");
	
	Возврат ВсеТесты;
КонецФункции

Процедура ТестПересчитатьЕдиницуИзмерения() Экспорт
	
	ИсходноеКолВо = 1.5;
	КонечноеКолВо = 1500;
	КолВоСантиметр = 150000;
	
	Километр = Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду("008",,, Истина);
	Метр = Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду("006",,, Истина);
	Сантиметр = Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду("004",,, Истина);
	
	ПересчитанноеКолВо = Справочники.КлассификаторЕдиницИзмерения.ПересчитатьЕдиницуИзмерения(
		Километр, // Kilometer
		Метр, // meter
		ИсходноеКолВо
	);
	
	Ожидаем
	.Что(ПересчитанноеКолВо)
	.Равно(КонечноеКолВо);
	
	ПересчитанноеКолВо = Справочники.КлассификаторЕдиницИзмерения.ПересчитатьЕдиницуИзмерения(
		Метр,
		Километр,
		КонечноеКолВо
	);
	
	Ожидаем
	.Что(ПересчитанноеКолВо)
	.Равно(ИсходноеКолВо);
	
	// sentimeter check
	ПересчитанноеКолВо = Справочники.КлассификаторЕдиницИзмерения.ПересчитатьЕдиницуИзмерения(
		Километр,
		Сантиметр,
		ИсходноеКолВо
	);
	
	Ожидаем
	.Что(ПересчитанноеКолВо)
	.Равно(КолВоСантиметр);
	
	ПересчитанноеКолВо = Справочники.КлассификаторЕдиницИзмерения.ПересчитатьЕдиницуИзмерения(
		Сантиметр,
		Километр,
		КолВоСантиметр
	);
	
	Ожидаем
	.Что(ПересчитанноеКолВо)
	.Равно(ИсходноеКолВо);
	
КонецПроцедуры

Процедура ТестКонвертироватьТипЧисло() Экспорт
	
	ЧислоХМЛ = "1,00000000E+03"; // kilometer
	КонечноеЧисло = 1000;
	
	КонвертированноеЧисло = Справочники.КлассификаторЕдиницИзмерения.КонвертироватьТипЧисло(ЧислоХМЛ);
	
	Ожидаем
	.Что(КонвертированноеЧисло)
	.Равно(КонечноеЧисло);
	
КонецПроцедуры
