
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы документами сервисных работ на клиенте и сервере
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ОтфильтроватьСуммуИтого(Форма, ВидыТО, ВидТОТекущий) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Для каждого ВидТО Из ВидыТО Цикл
		ЭлементОбщейСуммы = Форма.Элементы[ВидТО + ИмяРеквизитаСуммы()];
		Если СтрНачинаетсяС(ЭлементОбщейСуммы.Имя, ВидТОТекущий) Тогда
			ЭлементОбщейСуммы.Видимость = Истина;
		Иначе
			ЭлементОбщейСуммы.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПересчитатьСумму(Форма, ВидыТО) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	// Очищаем сумму
	Для каждого ВидТО Из ВидыТО Цикл
		Форма[ВидТО + ИмяРеквизитаСуммы()] = 0;
	КонецЦикла;
	
	//  Рассчитываем сумму
	Для Счетчик1 = 1 По Объект.ВыполненныеРаботы.Количество() Цикл
		Для Счетчик2 = 1 По ВидыТО.Количество() Цикл
			ИмяРеквизитаОбщейСуммы = ВидыТО[Счетчик2 - 1] + ИмяРеквизитаСуммы();
			ИмяРеквизитаСуммыСтроки = ВидыТО[Счетчик2 - 1] + ИмяРеквизитаСуммы() + Строка(Счетчик1) + Строка(Счетчик2);
			Форма[ИмяРеквизитаОбщейСуммы] = Форма[ИмяРеквизитаОбщейСуммы] + Форма[ИмяРеквизитаСуммыСтроки];
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ИмяРеквизитаСуммы() Экспорт
	
	Возврат "Сумма";
	
КонецФункции

Функция НомерСтрокиИзИмениЭлемента(ИмяЭлемента) Экспорт
	Проверки.СвойствоЗаполнено(ИмяЭлемента);
	
	РезультатЧисло = "";
	Счетчик = 0;
	Пока Счетчик <= СтрДлина(ИмяЭлемента) Цикл
		Символ = Сред(ИмяЭлемента, Счетчик, 1);
		Если СтроковыеФункцииКлиентСервер.ЭтоЧисло(Символ) Тогда
			РезультатЧисло = РезультатЧисло + Символ;
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Возврат Число(РезультатЧисло);
КонецФункции

Функция ИмяЭлементаБезНомераСтроки(ИмяЭлемента) Экспорт
	Проверки.СвойствоЗаполнено(ИмяЭлемента);
	
	Счетчик = СтрДлина(ИмяЭлемента) - 1;
	Результат = ИмяЭлемента;
	Пока Счетчик > 0 Цикл
		Символ = Прав(Результат, 1);
		Если СтроковыеФункцииКлиентСервер.ЭтоЧисло(Символ) Тогда
			Результат = Лев(ИмяЭлемента, СтрДлина(Результат) - 1);
		Иначе
			Прервать;
		КонецЕсли;
		Счетчик = Счетчик - 1;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ИмяЭлементаБезНомераКолонки(ИмяЭлемента) Экспорт
	Проверки.СвойствоЗаполнено(ИмяЭлемента);
	Возврат Лев(ИмяЭлемента, СтрДлина(ИмяЭлемента) - 1);
КонецФункции

Функция РеквизитТЧПоИмениЭлемента(Форма, ИмяЭлемента) Экспорт
	СтрокаТаблицы = СтрокаТЧВыполненныеРаботыПоИмениЭлемента(Форма, ИмяЭлементаБезНомераКолонки(ИмяЭлемента));
	РеквизитТЧ = СтрокаТаблицы[ИмяЭлементаБезНомераСтроки(ИмяЭлемента)];
	Возврат РеквизитТЧ;
КонецФункции

Функция СтрокаТЧВыполненныеРаботыПоИмениЭлемента(Форма, ИмЭлемента) Экспорт
	Объект = Форма.Объект;
	Возврат Объект.ВыполненныеРаботы[ФормыСервисныеРаботыКлиентСервер.НомерСтрокиИзИмениЭлемента(ИмЭлемента) - 1];
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти