
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы документами сервисных работ на клиенте и сервере
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ОтфильтроватьСуммуИтого(Форма, ВидыТО, ВидТОТекущий) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Для каждого ВидТО Из ВидыТО Цикл
		ЭлементОбщейСуммы = Форма.Элементы[ВидТО + ИмяРеквизитаСуммы()];
		Если СтрНачинаетсяС(ЭлементОбщейСуммы.Имя, ВидТОТекущий) Тогда
			ЭлементОбщейСуммы.Видимость = Истина;
		Иначе
			ЭлементОбщейСуммы.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПересчитатьСумму(Форма, ВидыТО) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	// Очищаем сумму
	Для каждого ВидТО Из ВидыТО Цикл
		Форма[ВидТО + ИмяРеквизитаСуммы()] = 0;
	КонецЦикла;
	
	//  Рассчитываем сумму
	Для Счетчик1 = 1 По Объект.ВыполненныеРаботы.Количество() Цикл
		Для Счетчик2 = 1 По ВидыТО.Количество() Цикл
			ИмяРеквизитаОбщейСуммы = ВидыТО[Счетчик2 - 1] + ИмяРеквизитаСуммы();
			ИмяРеквизитаСуммыСтроки = ВидыТО[Счетчик2 - 1] + ИмяРеквизитаСуммы() + Строка(Счетчик1) + Строка(Счетчик2);
			Форма[ИмяРеквизитаОбщейСуммы] = Форма[ИмяРеквизитаОбщейСуммы] + Форма[ИмяРеквизитаСуммыСтроки];
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ИмяРеквизитаСуммы() Экспорт
	
	Возврат "Сумма";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти