
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПутьКФайламВыгрузки = "\storage\sdcard0\Download\ha_message.xml";
	ВыгружатьКартинки = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРеквизитовКомандФормы

&НаКлиенте
Процедура ГиперссылкаИзменитьНастройкиНажатие(Элемент)
	
	ИзменитьПутьКФайлу();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыгрузитьФайлКлиент(Команда)
	
	ПоказатьСостояниеСинхронизации(Истина);
	ОбновитьОтображениеДанных();
	ПодключитьОбработчикОжидания("Подключаемый_ВыгрузитьФайл", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыгрузитьФайл()
	
	ВыгрузитьФайл();
	
	ПоказатьСостояниеСинхронизации(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьФайл()
	
	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ПутьКФайламВыгрузки);
	
	Обработки.НастройкиПрограммы.СериализоватьБазуВХМЛ(ЗаписьХМЛ, ВыгружатьКартинки);
	
	ЗаписьХМЛ.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлКлиент(Команда)
	ПоказатьСостояниеСинхронизации(Истина);
	ПодключитьОбработчикОжидания("Подключаемый_ЗагрузитьФайл", 0.1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗагрузитьФайл()
	
	ЗагрузитьФайл();
	
	ПоказатьСостояниеСинхронизации(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайл()
	
	ЧтениеХМЛ = Новый ЧтениеXML;
	ЧтениеХМЛ.ОткрытьФайл(ПутьКФайламВыгрузки);
	
	Обработки.НастройкиПрограммы.ПрочитатьБазуИзХМЛ(ЧтениеХМЛ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСостояниеСинхронизации(АктивноЗадание)
	
	Элементы.ГруппаСинхронизацияВыполняется.Видимость = АктивноЗадание;
	Элементы.ГруппаСинхронизацияВыполнена.Видимость = Не АктивноЗадание;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПутьКФайлу();
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	//Диалог.Каталог = "\storage\sdcard0\Download";
	Диалог.Каталог = КаталогДокументов();
	
	Если Диалог.Выбрать() Тогда
		ПутьКФайламВыгрузки = Диалог.Каталог + "\ha_message.xml";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
