////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции справочника Проекты, доступные для нескольких форм
//
////////////////////////////////////////////////////////////////////////////////

Функция ЛимитХарактеристик() Экспорт
	Возврат 5;
КонецФункции

Функция ИмяКолонкиХарактеристики() Экспорт
	
	Возврат "ДеталиХаракт";
	
КонецФункции

Функция ИмяКолонкиЗначенияХарактеристики() Экспорт
	
	Возврат "ЗначениеДеталиХаракт";
	
КонецФункции

Функция ИмяРеквизитаФормулы() Экспорт
	Возврат "Формула";
КонецФункции

Функция ИмяРеквизитаЗначениеФормулы() Экспорт
	Возврат "ЗначениеФормулы";
КонецФункции

Функция ИмяГруппыДеталиХарактеристики() Экспорт
	
	Возврат "ДеталиГруппаХарактеристика";
	
КонецФункции
