
#Область ПрограммныйИнтерфейс

Функция АвтомобильПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КОЛИЧЕСТВО(Автомобили.Ссылка) КАК Количество,
	|	МАКСИМУМ(Автомобили.Ссылка) КАК Ссылка
	|ИЗ
	|	Справочник.Автомобили КАК Автомобили
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(Автомобили.Ссылка) = 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция ИзмерительТО_ВРЕМЯ() Экспорт
	Возврат "ВРЕМЯ";
КонецФункции

Функция ИзмерительТО_ПРОБЕГ() Экспорт
	Возврат "ПРОБЕГ";
КонецФункции

#КонецОбласти